[
  {
    "id":10001,
    "sex":"man",
    "Ranking":1,
    "playerName":"MA Long  ",
    "country":"CHINA",
    "point":3184,
    "imageSmallPath":"ma-long-thumb.png",
    "imageBigPath":"malong.png",
    "birth":"10/20/1988",
    "description":"Ma Long (simplified Chinese: 马龙; traditional Chinese: 馬龍; pinyin: Mǎ Lóng; born 20 October 1988) is a Chinese male table tennisplayer.[1] As of September 2015, he is ranked number 1 in the world, in the International Table Tennis Federation (ITTF).[3] Ma was born in Anshan, Liaoning, China. He has won a record 5 ITTF Pro Tour tournaments in a row. In this streak he has won 35 sets in a row. At the 2015 World Table Tennis Championships, Ma Long won the men's singles title against his compatriot Fang Bo 4 sets to 2.",
    "description2":"Ma is arguably the best two-winged looper in table tennis history. His serves appear to be traditional pendulum serves, but are some of the most visually deceptive in the world. Ma's playing style is that of the modern strategy of close-range third ball play, as his range of attack is nearly unparalleled. His play strategy is primarily forehand-oriented, choosing to dominate play with powerful forehand loops, reserving the backhand for controlled returns and to set up the forehand. Ma became the youngest world champion at 18 years old after he participated in the 2006 Bremen World Team Championship. Ma developed his foundations under the tutelage of Wang Hao and former Chinese National Team coach Ma Kai Xuan before studying under Qin Zhi Jian.",
    "videoPath1":"https://www.youtube.com/embed/8-wkPJQaI7Y",
    "videoPath2":"https://www.youtube.com/embed/5E_GVVFwV5E",
    "videoPath3":"https://www.youtube.com/embed/p_xCVCKptQ8"
  },
  {
    "id":10002,
    "sex":"man",
    "Ranking":2,
    "playerName":"XU Xin  ",
    "country":"CHINA",
    "point":3096,
    "imageSmallPath":"xuxin-thumb.png",
    "imageBigPath":"xuxin.png",
    "birth":"1/8/1990",
    "description":"Xu Xin (simplified Chinese: 许昕; traditional Chinese: 許昕; pinyin: Xǔ Xīn; born 8 January 1990) is a Chinese table tennis player and is currently the number 2 ranked player in the world, as of September 2015",
    "description2":"Xu Xin is one of the few penhold grip players in China, especially among the younger generation who are mostly shakehand players. He follows the footsteps of other penhold champions such as Wang Hao and Ma Lin. With his long arms and frame, he is able to more easily reach balls hit wide. His long arms enable a graceful, unique forehand loop, with his arm almost fully outstretched. He has also adopted the reverse penhold backhand grip, a recent development for China's backhand penholders, allowing a two winged attack. He still uses a traditional penhold backhand to block, lob, and push the ball with the forehand side of his racket. Xu Xin's main strength is his shot variation and blazing forehand loops at mid to far distance. He is also a good lob defender, with great serves and decent footwork. However, his preference to play at a far distance is also one of his main weaknesses. While giving himself more time between shots, it also gives his opponents more time to react and he can be tamed by skillful attackers with good shot selection and neat placement. He is also somewhat of a 'crowd entertainer' often coming up with wild, and sometimes inappropriate shots. This is perhaps due to his playful nature and confidence in playing. He admitted that he hopes to try to be more efficient and effective with his shot selection as he matures and carries more responsibilities.",
    "videoPath1":"https://www.youtube.com/embed/F8ujr2idNL8",
    "videoPath2":"https://www.youtube.com/embed/2aDr4mkVrFY",
    "videoPath3":"https://www.youtube.com/embed/HhS-baUt3es"
  },
  {
    "id":10003,
    "sex":"man",
    "Ranking":3,
    "playerName":"FAN Zhendong  ",
    "country":"CHINA",
    "point":3041,
    "imageSmallPath":"fanzendong-thumb.png",
    "imageBigPath":"fanzendong.png",
    "birth":"1/22/1997",
    "description":"Fan Zhendong (Chinese: 樊振东; born 22 January 1997) is a Chinese table tennis player. He is ranked number 3 in the official ITTFworld rankings as of September 2015",
    "description2":"A right-handed shakehand-grip player, Fan plays an attacking style of table tennis using his explosive footwork and thunderous forehand loops to finish off his opponents. Emerging as a 16-year-old wonderkid, Fan's playing style is often compared to his senior compatriot Ma Long. In addition to being trained by national team coaches, he has been specially trained by both Wang Hao and Ma Lin. His encounters against senior players in the Chinese national team drew much speculation and anticipation. His fearlessness and technique allow him to challenge highly rated, experienced players, sometimes even beating top players in thrilling style",
    "videoPath1":"https://www.youtube.com/embed/gAAY9PicnBQ",
    "videoPath2":"https://www.youtube.com/embed/r04gnhV7ndU",
    "videoPath3":"https://www.youtube.com/embed/q1D9k_WGaUM"
  },
  {
    "id":10004,
    "sex":"man",
    "Ranking":4,
    "playerName":"ZHANG Jike  ",
    "country":"CHINA",
    "point":2920,
    "imageSmallPath":"zhangjike-thumb.png",
    "imageBigPath":"zhangjike.png",
    "birth":"2/16/1988",
    "description":"Zhang Jike (simplified Chinese: 张继科; traditional Chinese: 張繼科; pinyin: Zhāng Jìkē; born 16 February 1988) is a Chinese table tennis player.[1][4] He was named after the Brazilian soccer player Zico. Zhang Jike is the reigning Olympic champion in singles. When he won the Olympic gold medal in singles,[6] he became the fourth male player in the history of table tennis to achieve a career grand slam. The others are Jan-Ove Waldner (in 1992), Liu Guoliang (in 1999) and Kong Linghui (in 2000).[7] Zhang, however, is the only one of the four who have been the reigning champion in all three competitions simultaneously. As he won consecutively first in WTTC 2011, then World Cup 2011, and then London Olympics 2012, he won the grand slam in only 445 days after his first major title, being the fastest player ever to do so",
    "description2":"Zhang Jike is a two-winged shakehand attacker, using a combination of quick topspin drive attacks, counters, and loops. He is primarily a speed-oriented player, using the harder blue sponge H3 for maximum drive. He stays very low to the ground and is exceptionally quick on his feet. He uses a backhand favored grip and does not change his grip for forehand shots. Among all the Chinese National team players, he is known for having the best backhand technique, often using it in the forehand corner, especially when returning heavy under-spin serves and pushes. His backhand on-the-table flick is widely regarded as one of the best in the world.",
    "videoPath1":"https://www.youtube.com/embed/uPLb5I2x0kI",
    "videoPath2":"https://www.youtube.com/embed/Xs6hai_C9Qs",
    "videoPath3":"https://www.youtube.com/embed/sswoYE028fk"
  },
  {
    "id":10005,
    "sex":"man",
    "Ranking":5,
    "playerName":"OVTCHAROV Dimitrij  ",
    "country":"GERMANY",
    "point":2904,
    "imageSmallPath":"dimitrijovtcharo-thumb.png",
    "imageBigPath":"dimitrijovtcharov.png",
    "birth":"9/2/1988",
    "description":"Dimitrij Ovtcharov (Russian: Дмитрий Овчаров) or Dmytro Ovtcharov (Ukrainian: Дмитро Овчаров; born 2 September 1988) is a Ukrainian-born German table tennis player.[3] His father Mykhailo (himself national level table tennis player, and USSR National champion in 1982) has moved his family to Germany shortly after Dimitrij was born.",
    "description2":"At the 2008 Summer Olympics in Beijing, Ovtcharov won the silver medal as part of the German men's team, together with Timo Boll and Christian Süß. On September 22, 2010 Ovtcharov had been suspended by the German Table Tennis Federation (DTTB) due to a positive A-sample test for Clenbuterol that may be used as performance-enhancing substance.[7] Ovtcharov himself denied the doping accusation and requested a B-sample analysis which still tested positive.[8][9] After hearings and further investigations, the hair sample voluntarily offered by Ovtcharov showed no evidence of clenbuterol and its abuse. DTTB later unanimously decided to abolish the suspension on October 15, 2010.[10] The decision was endorsed by ITTF.",
    "videoPath1":"https://www.youtube.com/embed/STPSVdDpWbA",
    "videoPath2":"https://www.youtube.com/embed/3EOBcSxM5IY",
    "videoPath3":"https://www.youtube.com/embed/ogiPZwOipNY"
  },
  {
    "id":10006,
    "sex":"man",
    "Ranking":6,
    "playerName":"MIZUTANI Jun  ",
    "country":"JAPAN",
    "point":2859,
    "imageSmallPath":"mizutaniJun-thumb.png",
    "imageBigPath":"mizutaniJun.png",
    "birth":"6/9/1989",
    "description":"Jun Mizutani (Japanese: 水谷 隼; born 9 June 1989) is a male Japanese table tennis player.[1] He became the youngest Japanese national champion at the age of 17.[3] His consecutive singles titles at the national championships from 2007 to 2011 made him the first man to win the event five times in a row.",
    "description2":"Jun Mizutani is a product of the developments of the Japanese Table Tennis Association. At such a young age, he has been sent by the Japanese Team to train and participate in league competitions in Europe. Also, he was trusted by the association to participate in a variety of world competitions, just to accumulate experience.",
    "videoPath1":"https://www.youtube.com/embed/7sSIi8_4Phk",
    "videoPath2":"https://www.youtube.com/embed/7sSIi8_4Phk",
    "videoPath3":"https://www.youtube.com/embed/ax0n6MfW-2g"
  },
  {
    "id":10007,
    "sex":"man",
    "Ranking":7,
    "playerName":"BOLL Timo  ",
    "country":"GERMANY",
    "point":2763,
    "imageSmallPath":"Timo_Boll-thumb.png",
    "imageBigPath":"TimoBoll.png",
    "birth":"3/8/1981",
    "description":"Timo Boll (born 8 March 1981) is a German professional table tennis player who currently plays with Borussia Düsseldorf and is ranked second in the German Table Tennis National League.[3] He is currently 7th in the ITTF world rankings as of October 2015, having previously been number one",
    "description2":"Timo Boll is a left-handed player whose best weapon is his forehand topspin drive but is also noted for his extremely quick backhand loop. His blade is the \"Timo Boll ALC\" with Tenergy 05 rubbers on both sides.",
    "videoPath1":"https://www.youtube.com/embed/n-hHQIFe6os",
    "videoPath2":"https://www.youtube.com/embed/9wrP-5b139Y",
    "videoPath3":"https://www.youtube.com/embed/BHAI6IWtBbQ"
  },
  {
    "id":10008,
    "sex":"man",
    "Ranking":8,
    "playerName":"FREITAS Marcos  ",
    "country":"PORTUGAL",
    "point":2722,
    "imageSmallPath":"marcosFreitas-thumb.png",
    "imageBigPath":"marcosFreitas.png",
    "birth":"4/8/1988",
    "description":"Marcos  Freitas (born 8 April 1988) is a European Champion table tennis player from Portugal.",
    "description2":"He participated at the 2008 Summer Olympics in Beijing where he got knocked out in the Round of 64. In the same year he won the bronze medal in the men's doubles at the European Championship with Tiago Apolónia. Three years later at the 2011 Table Tennis European Championships he went on to win the gold medal with his doubles partner Andrej Gaćina. In 2012 he took part on his second Olympics, reaching the Round of 32 in the singles and the quarterfinals in the team event with Tiago Apolónia and João Monteiro.[1][4] In June 2015, he competed in the inaugural European Games, for Portugal in table tennis, more specifically, Men's team with João Geraldo and Tiago Apolonia. He earned a gold medal. At the European Championships 2015 he won Silver in the Singles Event.",
    "videoPath1":"https://www.youtube.com/embed/t3BFUR_Br9I",
    "videoPath2":"https://www.youtube.com/embed/2oqUuNC1APo",
    "videoPath3":"https://www.youtube.com/embed/NyeN3ydVyAw"
  },
  {
    "id":10009,
    "sex":"man",
    "Ranking":9,
    "playerName":"FANG Bo  ",
    "country":"CHINA",
    "point":2721,
    "imageSmallPath":"fangbo-thumb.png",
    "imageBigPath":"fangbo.png",
    "birth":"1/9/1992",
    "description":"Fang Bo (Chinese: 方博; pinyin: Fāng Bó; born 9 January 1992) is a Chinese male table tennis player.[3] He won all four team and individual titles at the 2009 World Junior Championships.[4] In 2015, he reached the men's singles final at the World Championships by defeating the second-seeded Xu Xin and the defending champion Zhang Jike.",
    "description2":"",
    "videoPath1":"https://www.youtube.com/embed/byOgflNf8DM",
    "videoPath2":"https://www.youtube.com/embed/lb98z5WC1HE",
    "videoPath3":"https://www.youtube.com/embed/QiEsMxtYMIo"
  },
  {
    "id":10010,
    "sex":"man",
    "Ranking":10,
    "playerName":"CHUANG Chih-Yuan  ",
    "country":"TAIWAN",
    "point":2679,
    "imageSmallPath":"Chuang_Chih-Yuan-thumb.png",
    "imageBigPath":"ChuangChihYuan.png",
    "birth":"4/2/1981",
    "description":"Chuang Chih-Yuan (traditional Chinese: 莊智淵; simplified Chinese: 庄智渊; pinyin: Zhuāng Zhìyuān; born 2 April 1981) is a Taiwanese table tennis player.[4] Winner of ITTF Pro Tour Grand Finals 2002. As of December 2014 he is ranked 8 in the world.",
    "description2":"",
    "videoPath1":"https://www.youtube.com/embed/1er5uf4RvxA",
    "videoPath2":"https://www.youtube.com/embed/0OG11hpxhRw",
    "videoPath3":"https://www.youtube.com/embed/1TS7G0VXCxg"
  },
  {
    "id":10011,
    "sex":"man",
    "Ranking":11,
    "playerName":"SAMSONOV Vladimir  ",
    "country":"BULGARIA",
    "point":2618,
    "imageSmallPath":"vladimirsamsonov-thumb.png",
    "imageBigPath":"vladimirsamsonov.png",
    "birth":"4/17/1976",
    "description":"Vladimir Samsonov (Belarusian: Уладзімір Самсонаў, Łacinka: Uładzimir Samsonaŭ) (born April 17, 1976 in Minsk) is a Belarusian professional table tennis player, ranked ninth in the world as of October 2011.[2][4] He is known in China as the \"Tai Chi Master\" because of his superb all-around (both offensive and defensive) style.",
    "description2":"He is known as Mr.ECL (European Champions League) for participating in the tournament for at least 15 years straight and because he currently holds nine (9) ECL winner titles - three with Borussia, five with Charleroi, and two with Fakel Orenburg. He began his European club career when he joined Borussia Düsseldorf in 1994, then seven years later moved to Royal Charleroi in Belgium. In 2008 he moved to Spain to play for Cajagranada, but the things didn't go the way he planned and two years later he decided to join Russian superleague club Fakel Orenburg.\n\nHe is famous for being a top-10 player longer than anyone else in official ranking history save for the legend of table tennis Jan-Ove Waldner. He first joined the top-10 in 1996, then climbed to the top position in 1998. He stayed in the top-10 for 15 years until November 2011. He is ranked #8 as of July 2015.[5] He also currently holds the distinction of being the player with most ITTF ProTour gold medals - 26 ProTour titles.\n\nIn June 2015, he competed in the inaugural European Games, for Belarus in table tennis, more specifically, Men's singles. He earned a silver medal.",
    "videoPath1":"https://www.youtube.com/embed/Y1zDDGFisLI",
    "videoPath2":"https://www.youtube.com/embed/51P6Rs59-r4",
    "videoPath3":"https://www.youtube.com/embed/U_WhEWHpquM"
  },
  {
    "id":10012,
    "sex":"man",
    "Ranking":12,
    "playerName":"JUNG Youngsik  ",
    "country":"KOREA",
    "point":2614,
    "imageSmallPath":"jungYongsik-thumb.png",
    "imageBigPath":"jungYongsik.png",
    "birth":"1/20/1992",
    "description":"Jung Young-Sik (born January 20, 1992) is a South Korean male table tennis player.[1][4] He is currently one of the top-ranked Korean table tennis players International Table Tennis Federation (ITTF).[3] His ranking improved from 21 to 16 in the ITTF world rankings as of August, 2015 after great performance in China Open 2015.",
    "description2":"",
    "videoPath1":"https://www.youtube.com/embed/r6NRqWJq4Rk",
    "videoPath2":"https://www.youtube.com/embed/S-8E2fFca3E",
    "videoPath3":"https://www.youtube.com/embed/gWl2RReQke4"
  },
  {
    "id":10013,
    "sex":"man",
    "Ranking":13,
    "playerName":"YAN An  ",
    "country":"CHINA",
    "point":2589,
    "imageSmallPath":"anyan-thumb.png",
    "imageBigPath":"anyan.png",
    "birth":"1/12/1993",
    "description":"Yan An was born in the Chinese capital of Beijing and his father is Yan Yongguo, coach of the Beijing Provincial Team. Coming from a family with a heavy background in table tennis, Yan An naturally grew up playing the sport. ",
    "description2":"Yan An's first World Tour Men's Singles championship title came in year 2013 in Sweden. He defeated Fan Zhendong in the finals in 4-2. \n\nIn 2011, Yan An was considered to be the most promising rookie of the Chinese Team. Hence, the opportunities to play in World Championships came. However, his efforts seem lacking and now, the much younger Fan Zhendong has overtaken him. Yan An had to work double to catch up with the fast-progressing Fan Zhendong. ",
    "videoPath1":"https://www.youtube.com/embed/ax0n6MfW-2g",
    "videoPath2":"https://www.youtube.com/embed/WBef5np6Q60",
    "videoPath3":"https://www.youtube.com/embed/gywvMDtv1LM"
  },
  {
    "id":10014,
    "sex":"man",
    "Ranking":14,
    "playerName":"NIWA Koki  ",
    "country":"JAPAN",
    "point":2587,
    "imageSmallPath":"niwakoki-thumb.png",
    "imageBigPath":"niwakoki.png",
    "birth":"10/10/1994",
    "description":"Koki Niwa (丹羽 孝希 Niwa Kōki?, born 10 October 1994) is a Japanese male table tennis player.[1] He is the gold medalist at the 2010 Youth Olympic Games and he won the World Junior Table Tennis Championships in 2010 (doubles) and 2011 (singles).[4] He is currently one of the top players under the age of 21",
    "description2":"On 21 April 2012, he defeated Ma Long of China, World Rank no 1, to become the first player to be qualified for 2012 Olympics from the Asian Olympic Qualifiers.[6]\n\nSince 2012 he is playing for the German Team TTC matec Frickenhausen.\n\nHe won the 2014 Russian Open singles title.",
    "videoPath1":"https://www.youtube.com/embed/jlJh4j8yPtQ",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":10015,
    "sex":"man",
    "Ranking":15,
    "playerName":"TANG Peng  ",
    "country":"HONG KONG",
    "point":2577,
    "imageSmallPath":"tangpeng-thumb.png",
    "imageBigPath":"tangpeng.png",
    "birth":"2/4/1981",
    "description":"Tang Peng (simplified Chinese: 唐鹏; traditional Chinese: 唐鵬; pinyin: Táng Péng; Jyutping: tong4 paang4; born 4 February 1981 in Beijing, China) is a table tennis player from Hong Kong, China.[1] He recently married Tie Yana, another table tennis player representing Hong Kong.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":10016,
    "sex":"man",
    "Ranking":16,
    "playerName":"WONG Chun Ting  ",
    "country":"HONG KONG",
    "point":2568,
    "imageSmallPath":"Wong_Chun_Ting-thumb.png",
    "imageBigPath":"WongChunTing.png",
    "birth":"9/7/1991",
    "description":"Wong Chun Ting (Chinese: 黃鎮廷; pinyin: Huāng Zhèntíng; born 7 September 1991) is a male table tennis player.[2] He won his first doubles title on the ITTF World Tour in 2012 and won another three doubles titles in 2014.[3] In 2015, he won a bronze medal in mixed doubles event with Doo Hoi Kem at the World Championships.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":10017,
    "sex":"man",
    "Ranking":17,
    "playerName":"JOO Saehyuk  ",
    "country":"KOREA",
    "point":2560,
    "imageSmallPath":"Saehyuk-Joo-thumb.png",
    "imageBigPath":"SaehyukJoo.png",
    "birth":"1/20/1980",
    "description":"Joo Sae-Hyuk (born January 20, 1980 in Seoul) is a South Korean table tennis player who has revolutionized the way players think about the defensive style.[2][3] As a singles player, he was a silver medalist at the 2003 World Table Tennis Championships, a bronze medalist at the 2011 Table Tennis World Cup, and a bronze medalist at the 2010 and 2014 Asian Games. [4] In the team event, as a member of the South Korean National Team, he was a silver medalist in the 2002, 2006, 2010, and 2014 Asian Games; the 2006 and 2008 World Championships; and the 2012 Summer Olympics",
    "description2":"Joo Sae-Hyuk has helped revive the popularity of the defensive style at the professional level.[6] He is one of the few top-ranked players in the world[7] to play a primarily defensive style, repeatedly returning the ball with heavy backspin on both wings.[8] This has led some to dub him the world’s best defensive player.[9] At the same time, he has a powerful topspin forehand that he uses to counterattack when the opportunity may arise.[10] As with many defenders, his long rallies and entertaining style of play have made him a fan favourite. He is one of several foreign players in recent years to challenge China's dominance over the sport",
    "videoPath1":"https://www.youtube.com/embed/BaxGYiPm_Bg",
    "videoPath2":"https://www.youtube.com/embed/gatqZi2bm7E",
    "videoPath3":""
  },
  {
    "id":10018,
    "sex":"man",
    "Ranking":18,
    "playerName":"YOSHIMURA Maharu  ",
    "country":"JAPAN",
    "point":2491,
    "imageSmallPath":"YOSHIMURA_Maharu-thumb.png",
    "imageBigPath":"YOSHIMURAMaharu.png",
    "birth":"8/3/1993",
    "description":"Maharu Yoshimura (吉村 真晴 Yoshimura Maharu?, born 3 August 1993) is a Japanese table tennis player. Yoshimura was born in Ibaraki Prefecture to a Japanese father and a Filipina mother. His first name is a Japanese translation of the Tagalog word \"Mahal\", meaning \"beloved\"",
    "description2":"In 2011, while in junior high school, he competed in the February Table Tennis Tournament Japan where he advanced to the top 12. He defeated Kazuhiro Zhang in the semi-finals but lost to Jun Mizutani in the final game. His achievements include the Asian Championships (New Delhi, India; the first victory of a Japanese player in the men's singles[2]) and the All Japan Table Tennis Championships. At the 2015 World Table Tennis Championships, Yoshimura won a silver medal in the mixed doubles event with Kasumi Ishikawa.",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":10019,
    "sex":"man",
    "Ranking":19,
    "playerName":"LEE Sangsu  ",
    "country":"KOREA",
    "point":2486,
    "imageSmallPath":"lee-sangsu-thumb.png",
    "imageBigPath":"leesangsu.png",
    "birth":"8/13/1990",
    "description":"Lee Sang-Su (born 13 August 1990) is a South Korean table tennis player.[2] He won two singles titles at the ITTF World Tour, the first one was in 2010.",
    "description2":"",
    "videoPath1":"https://www.youtube.com/embed/TUyocIVLUt4",
    "videoPath2":"https://www.youtube.com/embed/lYhePkhtImE",
    "videoPath3":"https://www.youtube.com/embed/DwFqw4jzcw8"
  },
  {
    "id":10020,
    "sex":"man",
    "Ranking":20,
    "playerName":"GAO Ning  ",
    "country":"SINGAPORE",
    "point":2459,
    "imageSmallPath":"gao-ning-thumb.png",
    "imageBigPath":"gaoning.png",
    "birth":"10/11/1982",
    "description":"Gao Ning (simplified Chinese: 高宁; traditional Chinese: 高寧; pinyin: Gāo Níng; born 11 October 1982 in Hubei, China) is a male Table Tennis player from Singapore.[1] He is considered Singapore's best male player with a world ranking of 19 as of December, 2012.[2] He was first in men's singles at the 2007 Commonwealth Table Tennis Championships.",
    "description2":"He won a gold medal as a team member plus silver medals in the men's singles and men's doubles at the 2010 Commonwealth Games in Delhi.\n\nGao Ning cried after his singles match defeat to an opponent in the Beijing 2008 Olympics as no coach was available to guide him during the match. His coach was sick before the match. The scene of him in tears was telecast on local TV, causing the head coach of the Singapore table tennis team to lose his job.\n\nAt the 2014 Commonwealth Games, he won another two gold medals and a silver.[5] The gold medals came in the men's doubles, with Li Hu, and the men's team, again with Li, and Zhan Jian.[5] The silver came in the men's individual, where he lost the final to his team-mate Zhan.",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20001,
    "sex":"woman",
    "Ranking":1,
    "playerName":"DING Ning  ",
    "country":"CHINA",
    "point":3279,
    "imageSmallPath":"dingNing2.png",
    "imageBigPath":"dingNing1.png",
    "birth":"6/20/1990",
    "description":"Ding Ning (simplified Chinese: 丁宁; traditional Chinese: 丁寧; pinyin: Dīng Níng; born 20 June 1990) is a Chinese table tennis player.[1] She was the winner of women's singles in the 2011 World Table Tennis Championships. At the 2015 World Table Tennis Championships, Ding Ning won her second world title in women's singles by defeating her compatriot Liu Shiwen 4-3 in the final.",
    "description2":"Despite her rich experience in competitions, Ding Ning received service offences during the competition. She was given a yellow and red card in the finals, leading her to lose her concentration and eventually lost the match in tears. \n\nSince her loss in London, a lot noticed a decline in her performance but Ding Ning continues to adhere to training and competition. In the 2014 Chinese Super League, Ding Ning brought her Beijing Team to new heights, landing first in the preliminary season. \n\nAs of now, Ding Ning still aims for the Grand Slam and for that to happen, she needs to prepare for the next Olympic Games to finally grab the Women's Singles title. ",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20002,
    "sex":"woman",
    "Ranking":2,
    "playerName":"LIU Shiwen  ",
    "country":"CHINA",
    "point":3276,
    "imageSmallPath":"liuShiwen2.png",
    "imageBigPath":"liuShiwen1.png",
    "birth":"4/12/1991",
    "description":"Liu Shiwen (simplified Chinese: 刘诗雯; traditional Chinese: 劉詩雯; pinyin: Liú Shīwén; born 12 April 1991) is a Chinese table tennis player.[1] She was the winner of 2009, 2012 and 2013 World Cup, 8 times winner of Pro Tour, winner of 2011, 2012 and 2013 Pro Tour Grand Final and the winner of Asian cup in 2010, 2012 and 2013. She held the ITTF number 1 rank for 9 consecutive months (from January to September, 2010). She is currently ranked 2nd in ITTF Women's World ranking as of September 2013.",
    "description2":"Liu Shiwen is also doing well in the World Championships. In 2013, she reached a new height in the competition after being in the finals. Losing to Li Xiaoxia, Liu Shiwen settled with silver, her highest so far. In the 2014 World Team Championships, she got to play in the finals and contributed a point. \n\nGreat progress has been seen from Liu Shiwen since the 2010 World Team Championships but for the coaching staff of the Chinese Team, she still needs to pass more test especially in Team competitions.",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20003,
    "sex":"woman",
    "Ranking":3,
    "playerName":"ZHU Yuling  ",
    "country":"CHINA",
    "point":3269,
    "imageSmallPath":"zhuYuling2.png",
    "imageBigPath":"zhuYuling1.png",
    "birth":"1/10/1995",
    "description":"Zhu Yuling (Chinese: 朱雨伶; born 10 January 1995) is a Chinese table tennis player.[3] She is the two-time winner of the World Junior Table Tennis Championships in girl's singles.[4] Semi-finalist at the 2013 World Table Tennis Championships.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20004,
    "sex":"woman",
    "Ranking":4,
    "playerName":"FUKUHARA Ai  ",
    "country":"JAPAN",
    "point":3175,
    "imageSmallPath":"FUKUHARAai2.png",
    "imageBigPath":"FUKUHARAai1.png",
    "birth":"11/1/1988",
    "description":"Ai Fukuhara (福原 愛 Fukuhara Ai?) (born 1 November 1988 in Sendai, Miyagi) is a Japanese table tennis player and Olympic medallist, winning silver at the 2012 Summer Olympics. She is sponsored by All Nippon Airways",
    "description2":"Fukuhara was directly qualified for the 2008 Summer Olympics through world ranking.[15] She was chosen as the national flag bearer for Japan at the Olympic Games in Beijing, China.[16] Fukuhara teamed up with Sayaka Hirano and Haruna Fukuoka at the women's team event. They reached the bronze medal contest but lost to South Korea. In the singles event, Fukuhara advanced to round of 16, losing to gold medalist Zhang Yining.\n\nShe also qualified directly for the London 2012 Olympic Games with her world ranking in June 2011, but lost to Ding Ning on 31 July 2012, (13–15, 6–11, 6–11, and 4–11).[17] At the Women's Team Event semi-finals, she defeated Feng Tianwei (11–9, 11–6, 5–11 and 11–9) in the first match which eventually helped Japan reached their first table tennis finals in the Olympics over Singapore.[18][19] However, Japan failed to defeat China in the finals but got her first silver medal ever in table tennis",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20005,
    "sex":"woman",
    "Ranking":5,
    "playerName":"LI Xiaoxia  ",
    "country":"CHINA",
    "point":3148,
    "imageSmallPath":"LIXiaoxia2.png",
    "imageBigPath":"LIXiaoxia1.png",
    "birth":"1/16/1988",
    "description":"Li Xiaoxia (simplified Chinese: 李晓霞; traditional Chinese: 李曉霞; pinyin: Lǐ Xiǎoxiá; born 16 January 1988) is a Chinese table tennis professional.[1]\n\nShe trains in the Jiangsu Wuxi Shanhe Club in Wuxi, China. Her trainer is Li Sun, who is also the mentor of Olympic gold medal winner Zhang Yining. It is expected that Li Xiaoxia will become one of the most valuable players of Team China in the future.[who?] As of April 2011, she occupies the top place on the ITTF women's world ranking.[2] In terms of achievements, she is one of the most successful female table tennis players (alongside Deng Yaping, Wang Nan and Zhang Yining) who have won the gold medal in each of the table tennis world cup, the table tennis world championships, and the table tennis olympics.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20006,
    "sex":"woman",
    "Ranking":6,
    "playerName":"ISHIKAWA Kasumi  ",
    "country":"JAPAN",
    "point":3131,
    "imageSmallPath":"ISHIKAWAKasumi2.png",
    "imageBigPath":"ISHIKAWAKasumi1.png",
    "birth":"2/23/1993",
    "description":"Kasumi Ishikawa (石川 佳純 Ishikawa Kasumi?) (born 23 February 1993) is a female Japanese table tennis player.[1] Her entire family, which consists of her father, mother, and younger sister, play or used to play competitive table tennis. She has a younger sister, Rira, who is also a professional table tennis player, while her mother Kumi Ishikawa is her current coach. She is a left-handed shakehand holder who primarily uses speedy top-spins and loops in offensive play.",
    "description2":"She reached the semi-finals of the Women's Singles at the London 2012 Olympics but lost out to eventual gold medal winner; Li Xiaoxia of China. In the bronze medal play-off, she lost out to eventual winner; Feng Tianwei of Singapore. She finished an overall 4th position. This was her first ever Olympics participation and despite her young age of 19, she was seeded no. 4 at the Women's Singles Event. She is also the first ever Japanese to have reached the semi-finals of the tournament.\n\nAt the Women's Team Event semi-finals, Kasumi Ishikawa helped Japan to overcome Singapore by defeating her quarter-finals opponent in the Single's, Wang Yuegu in three straight games. In the third Double's game, she paired up with Sayaka Hirano to overcome Wang Yuegu and Li Jiawei in three straight games as well. The wins together with Ai Fukuhara overcoming Feng Tianwei in the first game brought Japan to their first table tennis finals in the Olympics in three straight matches.[10][11] However, Japan failed to beat China in the finals but got their first ever silver medal in table tennis",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20007,
    "sex":"woman",
    "Ranking":7,
    "playerName":"FENG Tianwei  ",
    "country":"SINGAPORE",
    "point":3083,
    "imageSmallPath":"FengTianwei2.png",
    "imageBigPath":"FengTianwei1.png",
    "birth":"8/31/1986",
    "description":"Feng Tianwei (simplified Chinese: 冯天薇; traditional Chinese: 馮天薇; pinyin: Féng Tiānwēi, pronounced [fə̌ŋ tjɛ́nwéi]; born 31 August 1986) is a Singapore table tennis player. Born in China, she moved to Singapore under the Foreign Sports Talent Scheme in March 2007 and commenced her international career in competitive table tennis the following month. She received Singapore citizenship in January 2008.\n\nFeng represented Singapore for the first time in the Olympic Games at the 2008 Summer Olympics in Beijing. On 15 August 2008, the Singapore team comprising Feng and her teammates Li Jiawei and Wang Yuegu defeated South Korea 3–2 in the semifinals. The team lost to China in the final, but obtained the silver medal. This was Singapore's first Olympic medal in 48 years and its first as an independent nation. Feng won her first professional singles title at the International Table Tennis Federation (ITTF) Pro Tour Polish Open in Warsaw on 30 November 2008, in an all-Singapore final against Wang.\n\nOn 30 May 2010, the trio of Feng Tianwei, Wang Yuegu and Sun Beibei stunned the reigning champions China 3–1 in the Liebherr World Team Table Tennis Championships in Moscow. Feng defeated Ding Ning and Liu Shiwen in the 1st game and 4th game respectively. Wang defeated Liu Shiwen in the 2nd game, making Singapore world champion for the first time.\n\nOn 1 August 2012, Feng defeated Kasumi Ishikawa of Japan 4–0 to win the women's singles bronze medal at the 2012 Summer Olympics in London, Singapore's first Olympic singles medal since the 1960 Summer Olympics. On 7 August 2012, she was part of the women's team with Li and Wang that achieved the bronze against South Korea. This was the first time Singapore had won two medals at an Olympic Games.\n\nOn 15 March 2015, Feng defeated Zhu Yuling and Liu Shiwen at 2015 Asian Cup in Jaipur to crown Asian Cup Champion for the first time. At the same time, breaking China 7 consecutive years of dominance in this tournament.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20008,
    "sex":"woman",
    "Ranking":8,
    "playerName":"CHEN Meng  ",
    "country":"CHINA",
    "point":2995,
    "imageSmallPath":"CHENMeng2.png",
    "imageBigPath":"CHENMeng1.png",
    "birth":"1/15/1994",
    "description":"Chen Meng (Chinese: 陈梦; born 15 January 1994) is a Chinese table tennis player.[3] She is the winner of the 2011 World Junior Table Tennis Championships in girl's singles.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20009,
    "sex":"woman",
    "Ranking":9,
    "playerName":"HAN Ying",
    "country":"GERMANY",
    "point":2993,
    "imageSmallPath":"HanYing2.png",
    "imageBigPath":"HanYing1.png",
    "birth":"4/29/1983",
    "description":"Han Ying (simplified Chinese: 韩莹; traditional Chinese: 韓瑩; born 29 April 1983) is a former Chinese, now German table tennis player. She plays for KTS Tarnobrzeg.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20010,
    "sex":"woman",
    "Ranking":10,
    "playerName":"WU Yang  ",
    "country":"CHINA",
    "point":2933,
    "imageSmallPath":"WUYang2.png",
    "imageBigPath":"WUYang1.png",
    "birth":"1/5/1992",
    "description":"Wu Yang (simplified Chinese: 武杨; traditional Chinese: 武楊; pinyin: Wǔ Yáng; born January 5, 1992) is a female table tennis player from China.[1] She won the gold medal in the team events in the Asian Table Tennis Championships in 2009.[4] She won singles title at the 2009 World Junior Table Tennis Championships. She is known for her unorthodox but consistent chopping style, but can also be a strong counter-attacker.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20011,
    "sex":"woman",
    "Ranking":11,
    "playerName":"SEO Hyowon  ",
    "country":"KOREA",
    "point":2926,
    "imageSmallPath":"SEOHyowon2.png",
    "imageBigPath":"SEOHyowon1.png",
    "birth":"10/5/1987",
    "description":" Right handed defensive\nplayer with ability to attack with forehand\ntop spin. Winner of 2 GAC Group 2013 World Tour\ntitles – Poland and Korea",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20012,
    "sex":"woman",
    "Ranking":12,
    "playerName":"ITO Mima  ",
    "country":"JAPAN",
    "point":2906,
    "imageSmallPath":"ITOMima2.png",
    "imageBigPath":"ITOMima1.png",
    "birth":"10/21/2000",
    "description":"\"Mima Ito (伊藤 美誠 Itō Mima?) (born October 21, 2000) is a Japanese table tennis player.[8]\n\nAt the age of ten, she became the youngest person to win a match at the Japanese senior table tennis championships[1][9] and the youngest person to win an ITTF Junior Circuit tournament.[10] At eleven she defeated the player ranked 50th in the world at the time.[11]\n\nIn March 2014 she, together with Miu Hirano, won the doubles' title at German Open. They were both 13 at the time. Thus they became the youngest-ever winners of a doubles competition in the ITTF World Tour.[7][12]\n\nIn March 2015 she won, after beating Shan Xiaona, Che Xiaoxi and Feng Tianwei, the singles' title at German Open against Petrissa Solja.\"",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20013,
    "sex":"woman",
    "Ranking":13,
    "playerName":"JEON Jihee ",
    "country":"KOREA",
    "point":2880,
    "imageSmallPath":"JeonJihee2.png",
    "imageBigPath":"JeonJihee1.png",
    "birth":"28/10/92",
    "description":"Left handed shake hand\nattacking player. Won Women’s singles at the\n2011 Morocco Open",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20014,
    "sex":"woman",
    "Ranking":14,
    "playerName":"YANG Haeun  ",
    "country":"KOREA",
    "point":2843,
    "imageSmallPath":"YANGHaeun2.png",
    "imageBigPath":"YANGHaeun1.png",
    "birth":"2/25/1994",
    "description":"Yang Ha-eun (born 25 February 1994) is a South Korean female table tennis player.[2] She won two medals at the 2010 Summer Youth Olympics and she was a member of South Korean women's team at the 2012 World Team Championships.[3] In 2015, she won a gold medal in mixed doubles event with Xu Xin at the World Championships.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20015,
    "sex":"woman",
    "Ranking":15,
    "playerName":"LI Jie  ",
    "country":"Netherlands",
    "point":2816,
    "imageSmallPath":"LIJie2.png",
    "imageBigPath":"LIJie1.png",
    "birth":"3/6/1984",
    "description":"Li Jie (born 6 March 1984 in Chengdu, Sichuan) is a Chinese-born professional table tennis player who now represents the Netherlands.[1]\n\nShe was born in Chengdu, and resides in Den Helder. She currently plays for Spanish team Club Cartagena",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20016,
    "sex":"woman",
    "Ranking":16,
    "playerName":"SHAN Xiaona ",
    "country":"GERMANY",
    "point":2812,
    "imageSmallPath":"SHANXiaona2.png",
    "imageBigPath":"SHANXiaona1.png",
    "birth":"1/18/1983",
    "description":"Shan Xiaona ( born January 18, 1983 in the Chinese province of Liaoning ) is a German table tennis player of Chinese origin . It was 2013 and 2014 German champion and European champion with the team in 2013 and won each EM silver in singles and doubles competition .",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20017,
    "sex":"woman",
    "Ranking":17,
    "playerName":"SAMARA Elizabeta  ",
    "country":"ROUMANIA",
    "point":2784,
    "imageSmallPath":"samaraElizabeta2.png",
    "imageBigPath":"samaraElizabeta1.png",
    "birth":"4/15/1989",
    "description":"Elizabeta Samara (born April 15, 1989 in Constanţa), is a professional Romanian table tennis and a three-time European champion. She is currently the player of Fenerbahçe SK",
    "description2":"Romanian table tennis player Elizabeta Samara won on Sunday, October 4, the gold medal in women’s singles final at the European Championships in Ekaterinburg, Russia. She beat LI Jie of Netherlands 4:3 (11:6, 9:11, 3:11, 11:7, 12:14, 11:4, 11:4).\n\nThe two previously met in 2010, 2011 and 2014, and the Dutch player won every time.\n\nSamara also won silver in the women’s doubles on the same day, alongside Hungarian Georgina Pota. The two lost the final to Turkey’s Melek Hu  and Spain’s Yanfei Shen 4:1 (11:4, 11:7, 11:9, 13:11, 4:11).",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20018,
    "sex":"woman",
    "Ranking":18,
    "playerName":"CHENG I-Ching  ",
    "country":"TAIWAN",
    "point":2782,
    "imageSmallPath":"CHENGIChing2.png",
    "imageBigPath":"CHENGIChing1.png",
    "birth":"15/02/92",
    "description":"Right handed shake hand\nattacking player. Runner-up with Huang Yi-Hwa\nin WD at GAC Group 2012 Grand Finals",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20019,
    "sex":"woman",
    "Ranking":19,
    "playerName":"HIRANO Miu  ",
    "country":"JAPAN",
    "point":2762,
    "imageSmallPath":"HIRANOMiu2.png",
    "imageBigPath":"HIRANOMiu1.png",
    "birth":"4/14/2000",
    "description":"Miu Hirano (平野 美宇 Hirano Miu?) (born April 14, 2000) is a Japanese table tennis player.[6]\n\nIn March 2014 she, together with Mima Ito, won the doubles title at German Open. They were both 13 at the time. Thus they became the youngest-ever winners of a doubles competition in the ITTF World Tour.[4][7] She was in the national team of the 2014 Asian Games, making appearance on the gold medal match of the team event against China.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  },
  {
    "id":20020,
    "sex":"woman",
    "Ranking":20,
    "playerName":"DOO Hoi Kem  ",
    "country":"HONG KONG",
    "point":2746,
    "imageSmallPath":"DOOHoiKem2.png",
    "imageBigPath":"DOOHoiKem1.png",
    "birth":"11/27/1996",
    "description":"Doo Hoi Kem (Chinese: 杜凱琹; pinyin: Dù Kǎiqín; born 27 November 1996) is a female table tennis player.[2] She won two medals at the 2014 Summer Youth Olympics and she was a member of Hong Kong women's team at the 2014 World Team Championships.[3] In 2015, she won a bronze medal in mixed doubles event with Wong Chun Ting at the World Championships.",
    "description2":"",
    "videoPath1":"",
    "videoPath2":"",
    "videoPath3":""
  }
]